basisvectors/tarab-midi-64/firmware/Arduino AVR Files/MIDITwister/avr/boards.txt
midisixtyfour.name=TI-MIDI64
        
midisixtyfour.upload.tool=arduino:avrdude
midisixtyfour.upload.protocol=avr109
midisixtyfour.upload.maximum_size=28672
midisixtyfour.upload.maximum_data_size=2560
midisixtyfour.upload.speed=57600
midisixtyfour.upload.disable_flushing=true
midisixtyfour.upload.use_1200bps_touch=true
midisixtyfour.upload.wait_for_upload_port=true
midisixtyfour.bootloader.tool=arduino:avrdude
midisixtyfour.bootloader.low_fuses=0xff
midisixtyfour.bootloader.high_fuses=0xd8
midisixtyfour.bootloader.extended_fuses=0xcb
midisixtyfour.bootloader.file=caterina/Caterina-Leonardo.hex
midisixtyfour.bootloader.unlock_bits=0x3F
midisixtyfour.bootloader.lock_bits=0x2F     
midisixtyfour.build.mcu=atmega32u4
midisixtyfour.build.f_cpu=16000000L


midisixtyfour.build.vid=0x2342
midisixtyfour.build.pid=0x8032
midisixtyfour.build.usb_product="TI-MIDI64"


midisixtyfour.build.usb_manufacturer="TarabInstruments"
midisixtyfour.build.board=AVR_LEONARDO
midisixtyfour.build.core=arduino:arduino
midisixtyfour.build.variant=arduino:leonardo
midisixtyfour.build.extra_flags={build.usb_flags}



micromusinou.name=Arduino Micro musinou

micromusinou.upload.tool=arduino:avrdude
micromusinou.upload.protocol=avr109
micromusinou.upload.maximum_size=28672
micromusinou.upload.maximum_data_size=2560
micromusinou.upload.speed=57600
micromusinou.upload.disable_flushing=true
micromusinou.upload.use_1200bps_touch=true
micromusinou.upload.wait_for_upload_port=true
micromusinou.bootloader.tool=arduino:avrdude
micromusinou.bootloader.low_fuses=0xff
micromusinou.bootloader.high_fuses=0xd8
micromusinou.bootloader.extended_fuses=0xcb
micromusinou.bootloader.file=caterina/Caterina-Micro.hex
micromusinou.bootloader.unlock_bits=0x3F
micromusinou.bootloader.lock_bits=0x2F
micromusinou.build.mcu=atmega32u4
micromusinou.build.f_cpu=16000000L

micromusinou.build.vid=0x2340
micromusinou.build.pid=0x8030
micromusinou.build.usb_product="Arduino Micro musinou"

micromusinou.build.board=AVR_MICRO
micromusinou.build.core=arduino:arduino
micromusinou.build.variant=arduino:micro
micromusinou.build.extra_flags={build.usb_flags}

